Revit 2027 API
MEPBuildingConstructionSet.Erase Method
Removes a specified MEPBuildingConstruction from the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	MEPBuildingConstruction item
)
Public Overridable Function Erase (
	item As MEPBuildingConstruction
) As Integer
public:
virtual int Erase(
	MEPBuildingConstruction^ item
)
abstract Erase :
        item : MEPBuildingConstruction -> int
override Erase :
        item : MEPBuildingConstruction -> int
Parameters
item MEPBuildingConstruction
The MEPBuildingConstruction to be erased.
Return Value
Int32
The number of MEPBuildingConstructions that were erased from the set.
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace